Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.StructuralElementMayNotBeSupported Property
 Structural Element may not be supported -- verify support for Element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralElementMayNotBeSupported { get; }
Public Shared ReadOnly Property StructuralElementMayNotBeSupported As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralElementMayNotBeSupported {
	FailureDefinitionId^ get ();
}
static member StructuralElementMayNotBeSupported : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace